zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXA/MCXA577/startup_MCXA577.c
WEAK void TENBASET_PHY0_IRQHandler(void)
{
    TENBASET_PHY0_DriverIRQHandler();
}

WEAK void I3C2_IRQHandler(void)
{
    I3C2_DriverIRQHandler();
}

WEAK void LPUART5_IRQHandler(void)
{
    LPUART5_DriverIRQHandler();
}

WEAK void Reserved112_IRQHandler(void)
{
    Reserved112_DriverIRQHandler();
}

WEAK void LPSPI3_IRQHandler(void)
{
    LPSPI3_DriverIRQHandler();
}

WEAK void LPSPI4_IRQHandler(void)
{
    LPSPI4_DriverIRQHandler();
}

WEAK void LPSPI5_IRQHandler(void)
{
    LPSPI5_DriverIRQHandler();
}

WEAK void LPI2C4_IRQHandler(void)
{
    LPI2C4_DriverIRQHandler();
}

WEAK void I3C3_IRQHandler(void)
{
    I3C3_DriverIRQHandler();
}

WEAK void Reserved118_IRQHandler(void)
{
    Reserved118_DriverIRQHandler();
}

WEAK void USB1_HS_IRQHandler(void)
{
    USB1_HS_DriverIRQHandler();
}

WEAK void USB1_HS_PHY_IRQHandler(void)
{
    USB1_HS_PHY_DriverIRQHandler();
}

WEAK void Reserved121_IRQHandler(void)
{
    Reserved121_DriverIRQHandler();
}

WEAK void FLEXSPI0_IRQHandler(void)
{
    FLEXSPI0_DriverIRQHandler();
}

WEAK void Reserved123_IRQHandler(void)
{
    Reserved123_DriverIRQHandler();
}

WEAK void SMARTDMA_IRQHandler(void)
{
    SMARTDMA_DriverIRQHandler();
}

WEAK void CDOG1_IRQHandler(void)
{
    CDOG1_DriverIRQHandler();
}

WEAK void PKC_IRQHandler(void)
{
    PKC_DriverIRQHandler();
}

WEAK void SGI_IRQHandler(void)
{
    SGI_DriverIRQHandler();
}

WEAK void Reserved128_IRQHandler(void)
{
    Reserved128_DriverIRQHandler();
}

WEAK void TRNG0_IRQHandler(void)
{
    TRNG0_DriverIRQHandler();
}

WEAK void SECURE_ERR_IRQHandler(void)
{
    SECURE_ERR_DriverIRQHandler();
}

WEAK void SEC_HYPERVISOR_CALL_IRQHandler(void)
{
    SEC_HYPERVISOR_CALL_DriverIRQHandler();
}

WEAK void Reserved132_IRQHandler(void)
{
    Reserved132_DriverIRQHandler();
}

WEAK void Reserved133_IRQHandler(void)
{
    Reserved133_DriverIRQHandler();
}

WEAK void Reserved134_IRQHandler(void)
{
    Reserved134_DriverIRQHandler();
}

WEAK void RTC_IRQHandler(void)
{
    RTC_DriverIRQHandler();
}

WEAK void Reserved136_IRQHandler(void)
{
    Reserved136_DriverIRQHandler();
}

WEAK void Reserved137_IRQHandler(void)
{
    Reserved137_DriverIRQHandler();
}

WEAK void DGDET0_IRQHandler(void)
{
    DGDET0_DriverIRQHandler();
}

WEAK void EWM_IRQHandler(void)
{
    EWM_DriverIRQHandler();
}

WEAK void TSI_END_OF_SCAN_IRQHandler(void)
{
    TSI_END_OF_SCAN_DriverIRQHandler();
}

WEAK void TSI_OUT_OF_SCAN_IRQHandler(void)
{
    TSI_OUT_OF_SCAN_DriverIRQHandler();
}

WEAK void GPIO0_1_IRQHandler(void)
{
    GPIO0_1_DriverIRQHandler();
}

WEAK void GPIO1_1_IRQHandler(void)
{
    GPIO1_1_DriverIRQHandler();
}

WEAK void GPIO2_1_IRQHandler(void)
{
    GPIO2_1_DriverIRQHandler();
}

WEAK void GPIO3_1_IRQHandler(void)
{
    GPIO3_1_DriverIRQHandler();
}

WEAK void GPIO4_1_IRQHandler(void)
{
    GPIO4_1_DriverIRQHandler();
}

WEAK void GPIO5_1_IRQHandler(void)
{
    GPIO5_1_DriverIRQHandler();
}

WEAK void Reserved148_IRQHandler(void)
{
    Reserved148_DriverIRQHandler();
}

WEAK void ITRC0_IRQHandler(void)
{
    ITRC0_DriverIRQHandler();
}

WEAK void DMA0_CH8_IRQHandler(void)
{
    DMA0_CH8_DriverIRQHandler();
}

WEAK void DMA0_CH9_IRQHandler(void)
{
    DMA0_CH9_DriverIRQHandler();
}

WEAK void DMA0_CH10_IRQHandler(void)
{
    DMA0_CH10_DriverIRQHandler();
}

WEAK void DMA0_CH11_IRQHandler(void)
{
    DMA0_CH11_DriverIRQHandler();
}

WEAK void Reserved154_IRQHandler(void)
{
    Reserved154_DriverIRQHandler();
}

WEAK void Reserved155_IRQHandler(void)
{
    Reserved155_DriverIRQHandler();
}

WEAK void Reserved156_IRQHandler(void)
{
    Reserved156_DriverIRQHandler();
}

WEAK void Reserved157_IRQHandler(void)
{
    Reserved157_DriverIRQHandler();
}

WEAK void DMA1_CH0_IRQHandler(void)
{
    DMA1_CH0_DriverIRQHandler();
}

WEAK void DMA1_CH1_IRQHandler(void)
{
    DMA1_CH1_DriverIRQHandler();
}

WEAK void DMA1_CH2_IRQHandler(void)
{
    DMA1_CH2_DriverIRQHandler();
}

WEAK void DMA1_CH3_IRQHandler(void)
{
    DMA1_CH3_DriverIRQHandler();
}

//*****************************************************************************

#if defined(DEBUG)
#if defined(__GNUC__)
#pragma GCC pop_options
#endif //(__GNUC__)
#endif //(DEBUG)
